tutorials/validations4NFFoam/forcedConvection_ZeinaliHeris/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 298.0;
boundaryField
{
    inlet
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet
    {
	type		zeroGradient;
    }

    tube
    {
	type		fixedValue;
	value		uniform 363.0;
    }

}
// ************************************************************************* //
