tutorials/validations4NFFoam/forcedConvection_ZeinaliHeris/0/alpha_AL2O3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha_AL2O3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0.002;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet
    {
	type		zeroGradient;
    }

    tube
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
